# Core shell + terminal tooling
brew "fish"
brew "tmux"
brew "stow"
brew "git"
brew "libtool"
brew "cmake"
brew "gnupg"
brew "pinentry-mac"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "zoxide"

# Editors
brew "emacs-plus@30"

# Container / dev tooling
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "devcontainer"
brew "bun"

# Optional but common helpers
brew "gh"
